Documents/ЗаявкаНаРоуминг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаявкаНаРоуминг</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыгруженаЗаявкаОператоруСвязи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяSIMКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СлужебныеSIMКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаРоуминг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоездки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПоездок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЗаявкиНаРоумингЛимиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаявкиНаРоумингЛимиты</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПолучательРассылок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтправительПисьмаОператоруСвязи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаявкаНаРоуминг/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//+++АК LAGP 2018.06.05 ИП-00018863 Отказ от акцепта в заявках на роуминг.
	//Если ЭтотОбъект.ВыгруженаЗаявкаОператоруСвязи ИЛИ ЭтотОбъект.Статус = Перечисления.СтатусыЗаявокНаРоуминг.Подтвержден Тогда
	//	Отказ = ДопПраваПроведенияПроверить();	
	//КонецЕсли;
	//---АК LAGP
	
	Если НЕ (ЗначениеЗаполнено(ЭтотОбъект.СлужебнаяSIMКарта.ОператорСвязи) ИЛИ РольДоступна("ПолныеПрава")) Тогда
		Сообщить("В номере сотрудника не указан оператор связи!");
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

Функция ДопПраваПроведенияПроверить()
	
	МассивПраваУпрЗаявкамиНаРоуминг	 = УправлениеДопПравамиПользователей.ПрочитатьЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.УправлениеЗаявкамиНаРоуминг,Ложь,ПараметрыСеанса.ТекущийПользователь);	
	ПравоУправлениеЗаявкамиНаРоуминг = МассивПраваУпрЗаявкамиНаРоуминг[0];
	
	Если НЕ (ПравоУправлениеЗаявкамиНаРоуминг ИЛИ РольДоступна("ПолныеПрава") ИЛИ ПараметрыСеанса.ТекущийПользователь.ФизЛицо = ЭтотОбъект.РуководительСотрудника) Тогда
		Сообщить("Права на проведение заявки в данном статусе есть только у руководителя и управляющего заявками на роуминг.");
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции	

Функция ОбновитьЛимит()
	
	ТЗЛимит = РегистрыСведений.ЗаявкиНаРоумингЛимиты.СрезПоследних(ЭтотОбъект.Дата,);
	Лимит				= "";
	
	//Перебирает срез регистра от свежих к старым, пока не найдет лимит
	Если ТЗЛимит.Количество() > 0 Тогда
		ТЗЛимит.Сортировать("Период Убыв", Новый СравнениеЗначений);	
		
		Для каждого СтрокаТЗРегистра Из ТЗЛимит Цикл
			Если ЗначениеЗаполнено(Лимит)Тогда
				Прервать;	
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(Лимит) И ЗначениеЗаполнено(СтрокаТЗРегистра.Лимит) Тогда
				Возврат СтрокаТЗРегистра.Лимит;
			КонецЕсли;					
		КонецЦикла;		
	КонецЕсли;	
	
	Возврат 0;	
	
КонецФункции	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ Отказ И НЕ ЭтотОбъект.Ссылка.Пустая() Тогда
		ЭтотОбъект.ЛимитЗаявки = ОбновитьЛимит();
	КонецЕсли;		
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Перечисления.СтатусыЗаявокНаРоуминг.ПустаяСсылка();	
	//+++ AK suvv 24.04.2018 ИП-00018442
	//РуководительСотрудника = Справочники.ФизическиеЛица.ПустаяСсылка(); //+++АК LAGP 2018.06.05 ИП-00018863 Система акцепта упразднена. Руководитель больше не нужен.
	//--- AK suvv
	
КонецПроцедуры
